# Pandas

- Dibuat di atas library Numpy
- Melakukan operasi terhadap Series dan DataFrame

In [2]:
# Series : seperti array 1-d, hanya saja memiliki label
# DataFrame : seperti array 2-d, memiliki nama column

# Series

In [1]:
import numpy as np
import pandas as pd

In [4]:
# List of string
listChar = ['x', 'y', 'z']
print(listChar)

['x', 'y', 'z']

In [5]:
# List of integer
listNum = [10, 20, 30]
print(listNum)

[10, 20, 30]

In [6]:
# Tupple of integer
tupNum = (10, 20, 30)
print(tupNum)

(10, 20, 30)

In [7]:
# Array of Integer
arrNum = np.arange(10,31,10)
print(arrNum)

[10 20 30]

In [8]:
# Dictionary
dcn = {'a' : 10, 'b': 20, 'c': 30}
print(dcn)

{'a': 10, 'b': 20, 'c': 30}

In [9]:
#series menerima 1 paramere wajib, 1 tidak wajib

serChar = pd.Series(listChar)
print(serChar)
print(serChar[2])

0    x
1    y
2    z
dtype: object
z

In [10]:
serNum = pd.Series(listNum,listChar) #listChar akan menjadi label
print(serNum)

x    10
y    20
z    30
dtype: int64

In [11]:
serNum = pd.Series(data=listNum,index=listChar) #listChar akan menjadi label
print(serNum)

x    10
y    20
z    30
dtype: int64

In [12]:
print(serNum[1])
print(serNum['y'])
print(serNum['y'] + serNum['x'])

20
20
30

In [13]:
print(dcn)

{'a': 10, 'b': 20, 'c': 30}

In [14]:
serDcn = pd.Series(dcn)
print(serDcn)

a    10
b    20
c    30
dtype: int64

In [15]:
serNum + serNum

x    20
y    40
z    60
dtype: int64

In [16]:
serHero1 = pd.Series([1,2,3,4] , ['Axe', 'Windranger', 'Techies', 'Brew'])
print(serHero1)

Axe           1
Windranger    2
Techies       3
Brew          4
dtype: int64

In [17]:
serHero2 = pd.Series([1,2,3,4] , ['Axe', 'Windranger', 'Invoker', 'Brew'])
print(serHero2)

Axe           1
Windranger    2
Invoker       3
Brew          4
dtype: int64

In [18]:
resSum =serHero1 + serHero2
print(resSum)
print(np.isnan(resSum['Invoker']))
print(np.isnan(resSum['Axe']))

Axe           2.0
Brew          8.0
Invoker       NaN
Techies       NaN
Windranger    4.0
dtype: float64
True
False

# DATA FRAME

In [19]:
import numpy as np
import pandas as pd
from numpy.random import randn,randint #randint hanya 1-d & randn 2-d

In [20]:
np.random.seed(101)

In [21]:
# randn(5,4) , random number 2-d, 5 baris - 4 kolom
# DataFrame Parameter : data (2-d), index, column
dfNum = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

dfNum

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [22]:
#Akses berdasarkan kolom
dfNum['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [23]:
#Akses lebih dari satu kolom
dfNum[['W','X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [24]:
#Menambahkan kolom baru 'WY', datanya dari penjumlahan kolom 'W'&'Y'
dfNum['WY'] = dfNum['W'] + dfNum['Y']
dfNum

          W         X         Y         Z        WY
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

Drop

In [25]:
#AXIS

# DataFrame memiliki dua axis (default axis = 0)
# axis = 0 menunjuk baris [A B C D E]
# axis = 1 menunjuk kolom [W, X, Y, Z, WY]

In [26]:
# inplace = False, tidak menghapus dataframe asli, melainkan return dataframe baru
dfDropped = dfNum.drop('WY', axis=1)
dfDropped

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [27]:
dfNum

          W         X         Y         Z        WY
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [28]:
# inplace = True, menghapus dataframe aslinya.
dfNum.drop('WY', axis=1, inplace=True)
dfNum

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [29]:
dfNum.drop(['W','X'],axis=1) #Drop 2 kolom

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965
C  0.528813 -0.589001
D -0.933237  0.955057
E  2.605967  0.683509

LOC for LABEL

In [30]:
dfNum

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [31]:
dfNum.loc['B']

W    0.651118
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

In [32]:
dfNum.loc['B','W']

0.6511179479432686

In [33]:
dfNum.loc[['A','B']]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965

In [34]:
dfNum.loc[['A','B'],['W','X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318

ILOC for INDEX

In [35]:
dfNum

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [36]:
dfNum.loc['B'] #menggunakan label 'B'

W    0.651118
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

In [37]:
dfNum.iloc[1] #menggunakan index

W    0.651118
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

In [38]:
dfNum

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [39]:
dfNum.iloc[1:3, 2:4]

          Y         Z
B -0.848077  0.605965
C  0.528813 -0.589001

In [40]:
dfNum

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [41]:
dfNum.iloc[1:4, 2:4]

          Y         Z
B -0.848077  0.605965
C  0.528813 -0.589001
D -0.933237  0.955057

In [42]:
dfNum.iloc[3: , 1:4]

          X         Y         Z
D -0.758872 -0.933237  0.955057
E  1.978757  2.605967  0.683509

In [43]:
dfNum.iloc[1:4, :1]

          W
B  0.651118
C -2.018168
D  0.188695

In [44]:
dfNum.drop(['X'],axis=1)

          W         Y         Z
A  2.706850  0.907969  0.503826
B  0.651118 -0.848077  0.605965
C -2.018168  0.528813 -0.589001
D  0.188695 -0.933237  0.955057
E  0.190794  2.605967  0.683509

In [45]:
dfNum2 = dfNum.drop(['Z'],axis =1)
print(dfNum2)

          W         X         Y
A  2.706850  0.628133  0.907969
B  0.651118 -0.319318 -0.848077
C -2.018168  0.740122  0.528813
D  0.188695 -0.758872 -0.933237
E  0.190794  1.978757  2.605967

In [46]:
dfNum2.drop(['C'],axis =0)

          W         X         Y
A  2.706850  0.628133  0.907969
B  0.651118 -0.319318 -0.848077
D  0.188695 -0.758872 -0.933237
E  0.190794  1.978757  2.605967

>Filtering

In [52]:
dfNum

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [54]:
dfNum > 1

       W      X      Y      Z
A   True  False  False  False
B  False  False  False  False
C  False  False  False  False
D  False  False  False  False
E  False   True   True  False

In [55]:
dfNum[dfNum > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [56]:
dfNum

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [57]:
#untuk baris dengan nilai false akan dihapus
dfNum['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [58]:
dfNum[dfNum['W'] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [60]:
dfNum

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [62]:
# Hanya baris C yang bernilai True, maka hanya baris ini yang akan muncul
dfNum['Z'] < 0

A    False
B    False
C     True
D    False
E    False
Name: Z, dtype: bool

In [64]:
# Tampilkan data dimana untuk kolom Z nilainya  lebih besar dari 0
dfNum[dfNum['Z'] < 0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [67]:
# Tampilkan data dimana untuk kolom W nilainya lebih besar dari 0.2
dfNum[dfNum['W'] > 0.2]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965

In [71]:
dfNum

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [72]:
resultDf = dfNum[dfNum['W'] > 0]
resultDf

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [73]:
resultDf['W']

A    2.706850
B    0.651118
D    0.188695
E    0.190794
Name: W, dtype: float64

In [74]:
# Pilih kolom W untuk dataframe hasil filtering
dfNum[dfNum['W'] > 0]['W']

A    2.706850
B    0.651118
D    0.188695
E    0.190794
Name: W, dtype: float64

In [75]:
dfNum[dfNum['X'] < 1][['W','X','Z']]

          W         X         Z
A  2.706850  0.628133  0.503826
B  0.651118 -0.319318  0.605965
C -2.018168  0.740122 -0.589001
D  0.188695 -0.758872  0.955057

In [77]:
dfNum[dfNum['Z'] > 0.5][['X','Z']]

          X         Z
A  0.628133  0.503826
B -0.319318  0.605965
D -0.758872  0.955057
E  1.978757  0.683509

In [78]:
dfNum[dfNum['W'] > 0.18].loc[['A','D']]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
D  0.188695 -0.758872 -0.933237  0.955057

In [79]:
dfNum[dfNum['W'] > 0.18][['W','Z']].loc[['A','D']]

          W         Z
A  2.706850  0.503826
D  0.188695  0.955057

> 2 Condition Filtering

In [80]:
dfNum

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [82]:
#AND (&)
#kondisi 1 : kolom W>0
#kondisi 2 : kolom Y>1
dfNum[(dfNum['W'] >0) & (dfNum['Y'] > 1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [83]:
#OR (|)
#kondisi 1 : kolom W>0
#kondisi 2 : kolom Y>1
dfNum[(dfNum['W'] >0) | (dfNum['Y'] > 1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [84]:
newInd = 'IND MY SNG PH TH'.split()
newInd

['IND', 'MY', 'SNG', 'PH', 'TH']

In [86]:
dfNum['Country'] = newInd
dfNum

          W         X         Y         Z Country
A  2.706850  0.628133  0.907969  0.503826     IND
B  0.651118 -0.319318 -0.848077  0.605965      MY
C -2.018168  0.740122  0.528813 -0.589001     SNG
D  0.188695 -0.758872 -0.933237  0.955057      PH
E  0.190794  1.978757  2.605967  0.683509      TH

In [89]:
#tidak mengubah dataframe asli, melainkan me-return dataframe dgn index baru
dfNewId = dfNum.set_index('Country')
dfNewId

                W         X         Y         Z
Country
IND      2.706850  0.628133  0.907969  0.503826
MY       0.651118 -0.319318 -0.848077  0.605965
SNG     -2.018168  0.740122  0.528813 -0.589001
PH       0.188695 -0.758872 -0.933237  0.955057
TH       0.190794  1.978757  2.605967  0.683509

In [95]:
dfNewId.loc['IND']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: IND, dtype: float64

>Missing Value

In [98]:
d = {
    'A': [1,2,np.nan],
    'B': [5,np.nan,np.nan],
    'C': [1,2,3]
}

dfNum = pd.DataFrame(d)
dfNum

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

> dropna

In [102]:
#Drop semua baris yang memiliki nilai NaN
dfDropped = dfNum.dropna()
dfDropped

     A    B  C
0  1.0  5.0  1

In [103]:
#Drop semua baris yang memiliki 2 nilai NaN
dfDropped = dfNum.dropna(thresh=2)
dfDropped

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [104]:
#Drop semua kolom yang memiliki nilai NaN

dfDropped = dfNum.dropna(axis=1)
dfDropped

   C
0  1
1  2
2  3

In [105]:
#Drop semua kolom yang memiliki nilai 2 nilai NaN

dfDropped = dfNum.dropna(thresh=2,axis=1)
dfDropped

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

>fillna

In [106]:
dfNewVal = dfNum.fillna(value='NEW VALUE')
dfNewVal

           A          B  C
0          1          5  1
1          2  NEW VALUE  2
2  NEW VALUE  NEW VALUE  3

In [109]:
serA = dfNum['A'].fillna(value=dfNum['A'].mean())
serA

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [112]:
dfNum.fillna(value=dfNum['A'].mean())

     A    B  C
0  1.0  5.0  1
1  2.0  1.5  2
2  1.5  1.5  3

# Group By

In [114]:
data = {
    'Company' : 'GOOG GOOG MSFT MSFT FB FB'.split(),
    'Person' : 'Sam Charlie Amy Vanessa Carl Sarah'.split(),
    'Sales' : [200,120,340,124,243,350],
    'Salary' : [300,230,120,330,430,435]
}

dfEmp = pd.DataFrame(data)
dfEmp

  Company   Person  Sales  Salary
0    GOOG      Sam    200     300
1    GOOG  Charlie    120     230
2    MSFT      Amy    340     120
3    MSFT  Vanessa    124     330
4      FB     Carl    243     430
5      FB    Sarah    350     435

In [116]:
#dikelompokkan berdasarkan kolom Company

dfComp = dfEmp.groupby('Company')
dfComp

In [118]:
#Jumlahkan setiap data dari kolom yang datanya berupa angka

dfComp.sum()

         Sales  Salary
Company
FB         593     865
GOOG       320     530
MSFT       464     450

In [119]:
dfComp.mean()

         Sales  Salary
Company
FB       296.5   432.5
GOOG     160.0   265.0
MSFT     232.0   225.0

In [120]:
dfEmp.groupby('Company').min()

          Person  Sales  Salary
Company
FB          Carl    243     430
GOOG     Charlie    120     230
MSFT         Amy    124     120

In [121]:
dfEmp.groupby('Company').min().loc['FB']

Person    Carl
Sales      243
Salary     430
Name: FB, dtype: object

In [123]:
#menghitung banyak data per kolom
dfComp.count()

         Person  Sales  Salary
Company
FB            2      2       2
GOOG          2      2       2
MSFT          2      2       2

>Operations

In [127]:
data = {
    'col1' : [1,2,3,4],
    'col2' : [444,555,666,444],
    'col3' : 'abc def ghi xyz'.split()
}


dfCol = pd.DataFrame(data)
dfCol

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [132]:
#Value tertinggi
dfCol['col1'].max()

4

In [133]:
#index dari value tertinggi
dfCol['col1'].idxmax()

3

In [134]:
#Value terendah
dfCol['col2'].min()

444

In [135]:
#index dari value terendah
dfCol['col1'].idxmin()

0

In [131]:
dfCol['col2'].mean()

527.25

## Unique(Series)

In [140]:
dfCol

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [137]:
#Tampilkan data unique

resUniq = dfCol['col2'].unique()
print(resUniq)

[444 555 666]

## nunique (DataFrame & Series)

In [139]:
dfCol

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [138]:
resUniq = dfCol.nunique()
resUniq

col1    4
col2    3
col3    4
dtype: int64

## value_counts()

In [141]:
#menghitung banyaknya data yang sama pada sebuah kolom
dfCol

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [143]:
dfCol['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [144]:
dfCol['col3'].value_counts()

xyz    1
def    1
ghi    1
abc    1
Name: col3, dtype: int64

## sort_values(DataFrame)

In [149]:
#descending
dfCol.sort_values('col2',ascending=False)

   col1  col2 col3
2     3   666  ghi
1     2   555  def
0     1   444  abc
3     4   444  xyz

In [150]:
#Aescending
dfCol.sort_values('col2',ascending=True)

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

## Apply (DataFrame & Series)

In [4]:
data = {
    'odd' : [1,3,5,7],
    'even' :  [2,4,6,8],
    'others' : [13,24,35,46]
}

dfNum = pd.DataFrame(data)
dfNum

   odd  even  others
0    1     2      13
1    3     4      24
2    5     6      35
3    7     8      46

> **SERIES**.apply()

In [7]:
def times2(x):
    return x * 2

In [8]:
resApp = dfNum['odd'].apply(times2)
resApp

0     2
1     6
2    10
3    14
Name: odd, dtype: int64

In [9]:
resApp = dfNum['even'].apply(lambda x : x * 2)
resApp

0     4
1     8
2    12
3    16
Name: even, dtype: int64

In [12]:
resApp = dfNum['others'].apply(str)
resApp
# resApp.iloc[1]

0    13
1    24
2    35
3    46
Name: others, dtype: object

In [13]:
dfNum

   odd  even  others
0    1     2      13
1    3     4      24
2    5     6      35
3    7     8      46

In [15]:
#secara default akan diproses per kolom(axis=0)
dfApp = dfNum.apply(times2)
dfApp

   odd  even  others
0    2     4      26
1    6     8      48
2   10    12      70
3   14    16      92

In [17]:
#diproses per baris
dfApp = dfNum.apply(times2,axis=1)
dfApp

   odd  even  others
0    2     4      26
1    6     8      48
2   10    12      70
3   14    16      92

# DEFAULT PARAMETER

In [47]:
def manyParams(a=2, b=2, c=2, d=2, e=2, f=2, g=2, h=2, i=2):
    print(f'Isi dari parameter a : {a}')
    print(f'Isi dari parameter e : {e}')
    print(f'Isi dari parameter i : {i}')

In [48]:
manyParams('A', 'x', 'x', 'x', 'E', 'x', 'x', 'x', 'I')

Isi dari parameter a : A
Isi dari parameter e : E
Isi dari parameter i : I

In [49]:
manyParams(a='A', e='E', i='I')

Isi dari parameter a : A
Isi dari parameter e : E
Isi dari parameter i : I